{"id":11366,"slug":"axis-game-factorys-agfpro-v3","name":"Axis Game Factory's AGFPRO v3","name_original":"Axis Game Factory's AGFPRO v3","description":"Axis Game Factory’s AGFPRO v3.0 – for PC, MAC and LINUX<br/><br/><strong>We just released version 3.0 of AGFPRO &amp; Premium - there are a TON of new features, assets and functionality that have been added, giving users the ability to create amazing game levels and maps like NEVER BEFORE!!</strong><br/><br/>Major features to AGFPRO 3.0 include complete compatibility with Unity 5 for AGFPRO, Premium, Zombie FPS, Fantasy Side-Scroller, Drone Kombat, BattleMat Multiplayer, and Voxel Sculpt!  We have also added new character controls and characters in both the ARPG and Platformer Players!  What you will really see is the POWER and SPEED that comes with this update, allowing users to create lush scenes, filled with assets, foliage and other features and functionality. <br/><br/>AGFPRO v3.0 is a comprehensive toolset designed to provide game developers and enthusiasts with a powerful and rapid level creation, terrain/vegetation editing, lighting and atmosphere system. <br/><br/>AGF is an independent product that empowers users to create game levels and environments for many types of game genres, and the AGFPRO v3.0 PREMIUM version is also designed to work in concert with the Free and Pro versions of the Unity 5 game engine to allow further customization and game publishing. AGF runs on the PC, MAC and LINUX systems.<br/><br/>AGF allows developers to rapidly create game maps, sculpt terrain and design levels quickly and easily. With over 1000+ assets pre-stocked in the warehouse, along with 48 pre-set themes and 8 sample maps, developers and enthusiasts can begin creating levels in minutes. AGFPRO v3.0 includes all of the necessary tools to allow users the ability to import AGF scenes into Unity3d Free and Pro 5. <br/><br/>Creating game levels and maps in AGFPRO is easy and fun - now ANYONE can create their own quality game maps without having to program, model or animate!<br/><br/>Please note that in order to use AGFPRO Premium (DLC), you must first purchase AGFPRO.KEY FEATURES:<br/><strong>AGFPRO v3.0 now Features Nine (9) Key Areas or Apps for Development that Include:</strong><br/><ul><li>AGF Launch Pad<br/></li><li>AGF World Editor<br/></li><li>AGF Construct App<br/></li><li>AGF Browser<br/></li><li>AGF Packager<br/></li><li>AGF Scene Loader<br/></li><li>ARPG Player (Internal &amp;amp; External)<br/></li><li>Platform Player (Internal &amp;amp; External)<br/></li><li>FPS Player (External)</li></ul>New v3.0 AGF Launch Pad:<br/><ul><li>This App replaces the AGF editor from the AGF icon in Steam<br/></li><li>Launches all AGF Apps including the <strong>Editor</strong> from one toolbar<br/></li><li>No need to go through the Editor to launch the <strong>Players</strong></li></ul>New v3.0 AGF <strong>World Editor</strong> Features:<br/><ul><li>Redesigned GUI in the<strong> Editor</strong><br/></li><li>Dropdown menu system<br/></li><li>Collapsing, drag-able windows with easy to see icons<br/></li><li>3x Speed increase for terrain sculpting<br/></li><li>New Smoothing feature for the terrain sculpting has been added to give the user the ability to smooth and soften terrain on their maps<br/></li><li>New X, Y, Z directional compass added to the <strong>Editor</strong><br/></li><li>Camera automatically changes the atmosphere when users are underwater vs. above water<br/></li><li>Addition of &amp;quot;Build Time Clock&amp;quot; that is saved with each scene file every time users work, creating a standing time on how long each level takes to create</li></ul><br/><ul><li><strong>User-Friendly Project Creation Wizard</strong><br/></li><li>  o\tExtensive library of pre-set themes for immediate level design<br/></li><li>  o\tThemes include lighting, atmosphere, terrain, vegetation, &amp;amp; water pre-defined</li></ul><br/><ul><li><strong>Intuitive User Interface with &amp;quot;Radial Menu&amp;quot; to expedite workflow</strong> <br/></li><li>Drag and reorganize windows to customize UI<br/></li><li>On &amp;amp; Off feature quickly hide menus</li></ul><br/><ul><li><strong>Advanced Terrain Creation System</strong><br/></li><li>Adjustable: terrain size, splat map &amp;amp; vegetation detail resolution<br/></li><li>Supports terrains from 200 meters up to 200 meters down max<br/></li><li>Terrains are now expanded to a maximum terrain of 4,000 meters square<br/></li><li>3x Speed increase for terrain sculpting<br/></li><li>10 levels of undo for terrain editing<br/></li><li>Undo Vegetation, Painting and Sculpting independent of each other</li></ul><br/><ul><li><strong>Paint, Sculpt and Plant vegetation individually or simultaneously</strong><br/></li><li>Toggle: terrain visibility, painting, sculpting, planting</li></ul><br/><ul><li><strong>Sophisticated Brush Support</strong><br/></li><li>Extensive brush library with adjustable brush size, rotation, power, blend<br/></li><li>Edit the entire Default Brush library for users preference<br/></li><li>Project specific and default brushes independent of each other<br/></li><li>Via the new integrated <strong>AGF Browser</strong>, users can now import their own original:  Brushes, Terrain Textures, Terrain Vegetation Textures in PNG. Format<br/></li><li>Newly added:  Custom Images can be both loaded and removed for the Brushes – Terrain and Vegetation</li></ul><br/><ul><li><strong>Real Time Terrain Deformation and Painting System with Tri-Planar Texturing with Normal Maps</strong><br/></li><li>Toggle between tri-planar shader &amp;amp; simple<br/></li><li>Intuitive Terrain &amp;quot;Snap to Grid Height&amp;quot; to set terrain<br/></li><li>Numeric input and readout of terrain height at specific locations</li></ul><br/><ul><li><strong>Tri-Planar Shaders and Texturing</strong><br/></li><li>Shader automatically maps terrain inclines with user defined texture<br/></li><li>Over 40 textures included with Normal Maps</li></ul><br/><ul><li><strong>Terrain Texture Color Tinting Feature</strong><br/></li><li>Change individual textures or batch<br/></li><li>Change terrain textures quickly and update in real-time</li></ul><br/><ul><li><strong>Advanced Vegetation System</strong><br/></li><li>Adjustable vegetation density &amp;amp; distance, unlimited layers<br/></li><li>Set vegetation min. width, height &amp;amp; color spectrum</li></ul><br/><ul><li><strong>Advanced Global Vegetation Editor</strong><br/></li><li>Globally change vegetation color saturation, value, size, minimum width &amp;amp; height, color spectrums</li></ul><br/><ul><li><strong>Fully featured lighting and atmosphere configuration allows quick real time and run-time customization</strong></li></ul><br/><ul><li><strong>Customized Lighting System</strong><br/></li><li>Key, Fill, Back, and Ambient light sources<br/></li><li>Set light colors, flares &amp;amp; shadow configurations<br/></li><li>Extensive Lens Flares to “main” light in lighting rig (over 15)<br/></li><li>Newly added Underwater Lighting system</li></ul><br/><ul><li><strong>Fog System</strong><br/></li><li>Global and simple fog with a variety of parameters: density, falloff, color and distance<br/></li><li>Set fog haze, density, distance, color, height and falloff<br/></li><li>Newly added Fog System </li></ul><br/><ul><li><strong>Skyboxes – Select skybox cube maps with the ability to apply rotation &amp;amp; tint</strong></li></ul><br/><ul><li><strong>Beautiful water system with sliders for wave direction, speed, intensity, refraction/reflection color and foam properties</strong></li></ul><br/><ul><li><strong>Geometry Brush System</strong><br/></li><li>Create unlimited sets of geometry brushes<br/></li><li>Brushes function as an independent layer to edit<br/></li><li>Set min/max scale range<br/></li><li>Randomly rotate X, Y, Z coordinates<br/></li><li>Align to Normal<br/></li><li>Spray geometry from camera view direction</li></ul><br/><ul><li><strong>User-friendly file saving thumbnail generation for scenes when saved</strong></li></ul><br/><ul><li><strong>Extensive Presets to quickly start scenes (48 included)</strong><br/></li><li>Create custom presets and share with friends</li></ul><br/><ul><li><strong>Independent Pre-Fab Mode to create complex collections of assets outside of your scene</strong></li></ul><br/><ul><li><strong>Fully featured transformation tools include:</strong><br/></li><li>Select, Multiple-Select, Copy/Paste, Duplicate, Translate, Rotate &amp;amp; Scale</li></ul><br/><ul><li><strong>Intuitive Grid-Snapping and Collision Detection easily place objects in scene with new enhanced features that include:</strong><br/></li><li>On screen display of Grid Size<br/></li><li>On screen display of Grid-Snap Setting<br/></li><li>There are now reference numbers for both the X or Z Axis, the numbers change dynamically with the scale of the grid<br/></li><li>Grid Reference Number Scaling and Display Settings can be defined by the user</li></ul><br/><br/><strong>New Construct App Feature:</strong><br/><ul><li>Gone is the old prefab workspace and it has been moved into its very own App<br/></li><li> <strong>Construct</strong> is where you go to create your own prefab assets from the always-expanding library of textures and assets (over 1,000+) that are available in the <strong>AGFPRO Warehouse</strong><br/></li><li>Users can launch <strong>Construct</strong> from the <strong>Launchpad</strong> or from the <strong>Editor</strong><br/></li><li>Use the “refresh assets” button to load prefabs into the <strong>Warehouse</strong> library<br/></li><li><strong>Construct</strong> allows users to import their own .OBJ files (objects or assets) as well as .PNG texture files<br/></li><li>Load your own models, .OBJ files, directly into <strong>Construct</strong> – <strong>USERS NO LONGER HAVE TO IMPORT THEIR OWN ASSETS THROUGH UNITY PRO!!!!!</strong>   This feature is included in AGFPRO and Premium.<br/></li><li>Combine several .OBJ files and save them as a Prefab to be used in the <strong>World Editor</strong></li></ul><br/><br/><strong>New AGF Browser (file browser)</strong><br/><ul><li>This is a standalone browser that connects the AGF Apps together!<br/></li><li>The new <strong>AGF Browser</strong> is designed to be the glue that is used to bring in users custom content.  Now users are able to bring in their own Textures and Objects files into AGF creations without the necessity of using Unity Free or Unity Pro… This feature is HUGE as it empowers users the flexibility to create their own custom levels with any supported asset types they choose to bring in with the ability to take their scene files back into Unity to publish their own work </li></ul><br/><br/><strong>New AGF Packager</strong><br/><ul><li>By popular demand – we have added this great feature… AGF DLC users are able to package their games easily and share with anyone!  Just do the following:<br/></li><li>1) Select the Game Type <br/></li><li>2) Select the Project Folder<br/></li><li>3) Select the Destination of the New Game onto User’s Machine<br/></li><li>4) Give a Name to the Game<br/></li><li>… And the<strong> AGF Packager</strong> does the rest… it’s really that easy!  Best of all, friends do not need to own AGF to run the packaged game, nor do they need to have a Steam account. The Packaged Game is completely stand-alone, DRM FREE, and redistribution of users game(s) is encouraged. AGF Packager will make a game for the OS that it was packaged on. The AGF packaged games are NOT intended for resale. It’s about creating and sharing with all.<br/></li><li>As an option, the Packager will automatically zip the game(s) package for easy distribution and no installation is required for the end user to play – no installers are necessary for friends to play – just unzip and have fun!</li></ul><br/><br/><strong>New AGF Scene Loader Features:</strong><br/><ul><li>The AGF Scene Loader loads the AGF Scene Format into Unity Free and Unity Pro<br/></li><li>Custom Images that are used on terrains now load into Unity with scene(s) created in AGF<br/></li><li>Any locked assets in an AGF scene are no longer an issue… The AGF/Unity Scene Loader skips any assets that are not supposed to load automatically <br/></li><li>Any OBJ files that are loaded into AGF will also be loaded into Unity Free and Pro</li></ul><br/><br/><strong>Action Role-Playing Game Player:</strong><br/><ul><li>The ARGP Player provides users with player and camera controls that are genre specific for ARPG game creation<br/></li><li>Using the Internal Player, creations can be played in real-time to play test map creations <br/></li><li>The External Player allows users the ability to package and send their levels to others to play</li></ul><br/><br/><strong>Platform Player:</strong><br/><ul><li>The Platform Player provides users with player and camera controls that are genre specific for Platform game level creation<br/></li><li>The Internal Player allows users to immediately play and test their game maps in real-time<br/></li><li>The External Player allows users the ability to package and send their levels to others to play</li></ul><br/><br/><strong>First-Person Shooter Player:</strong><br/><ul><li>This Player provides the user with an FPS camera and controller, specific for FPS game level creation and play testing<br/></li><li>The FPS Player can be used with the AGF Packager to package their game levels to share with others<br/></li><li>This Player also supports Scene-Linking and allows users to share their AGF FPS game level creations with friends and link their maps together for endless gameplay!<br/></li><li>FPS Weapon asset packs are also included</li></ul><strong>AGFPRO v3.0 PREMIUM</strong><br/><ul><li>AGFPRO + PREMIUM ASSET Packager – users are able to package their assets in Unity Pro and use in the AGF tool-set<br/></li><li>Batch Asset Processing<br/></li><li>Automatic Icon Creation<br/></li><li>Over 500 Source Art Assets and Samples are included for Premium users</li></ul><strong>More Information on what AGFPRO is and what you can do with AGFPRO</strong><br/><ul><li>Users are able to create game levels and maps using the software and also place characters (provided with the software) to play and explore their levels with multiple player style options (Action Role Playing, Platformer, FPS)<br/><br/></li><li>Just to be CLEAR – AGFPRO is NOT a game engine.  It is literally made using the Unity game engine.  AGFPRO is a real-time, RAPID Game Environment Development Toolkit and is made to be used in concert with Unity Free and Pro for level/map creation. – However, AGFPRO does NOT need Unity to run or create levels/maps.<br/><br/></li><li>The scene files that users create in AGFPRO “Basic” and “Premium” can be imported into Unity4 Free and Pro using our AGF/Unity tools.<br/><br/></li><li>By using the DLC we have already released for AGFPRO (Fantasy Side-Scroller,  Zombie FPS, Drone Kombat, BattleMat Multiplayer &amp;amp; Voxel Sculp), users are able to create playable levels with AGFPRO (only – not viable with Unity) with a variety of characters, assets, gameplay mechanics and special feature, “Scene-Linking” to connect game levels<br/><br/></li><li>There are limitations to some asset packs “locked (L)” that limit the users from loading these assets into Unity.  All unlocked asset packs are free of copyright and can be used via Unity for redistribution per the terms of the EULA http://ttp://media.wix.com/ugd/43457c_ee338ac5b4f644eb8b432518a8bb3d79.pdf<br/><br/></li><li>The redistribution or “sharing” of the games users are able to make using AGF and DLC “Players” is a feature we are working on at this time and will be made available to users at no additional fee<br/><br/></li><li>Users are also able to create and place specific game play mechanics that are provided in the software<br/><br/></li><li>Full customization of your levels and maps is possible with AGFPRO Premium and Unity Pro, whereby users are able to bring in their own assets and models to make their games unique and further commercialize, making a complete Stand-Alone game</li></ul><strong>Additional Questions RE: AGFPRO?</strong><ul><li>If you are interested in making a complete Stand-Alone game with unique characters, models, assets and game play mechanics not provided in AGFPRO and  commercialize it for sale, you will need AGFPRO Premium and either Unity Free or Pro software<br/><br/></li><li>If you are a development team using AGFPRO + Premium, you will need one seat per team member using the software, but we do offer studio discounts, so be sure to contact us for special pricing<br/><br/></li><li>We have many schools all over the globe using AGFPRO to teach game development and design in the classroom, from middle schools to elite Colleges and Universities.  We have a basic curriculum available that instructors are able to include in their course curriculum and we provide additional support that includes software updates, access to DLC, non-Steam versions of the software if necessary, user support and special feature integration upon request and based on the terms of the agreement.  We offer special pricing for schools and we find that schools love using the software as it allows students the ability to create complete games within the limitation of a semester and is a great introduction to begin to interface with Unity3d, without users having to program, model, animate or script.  Please contact Tammy McDonald at tammy@heavyh2o.com if you have specific questions or interest regarding AGFPRO's Educational License.</li></ul>","metacritic":null,"metacritic_platforms":[],"released":"2013-11-19","tba":false,"updated":"2025-04-14T21:28:53","background_image":"https://media.rawg.io/media/screenshots/ad6/ad683211916758f37ddf0bb382001cdb.jpg","background_image_additional":"https://media.rawg.io/media/screenshots/058/058129db8cdc8f4264713ccf6fdcb5f4.jpg","website":"http://www.axisgamefactory.com/","rating":2.0,"rating_top":1,"ratings":[{"id":1,"title":"skip","count":8,"percent":53.33},{"id":3,"title":"meh","count":6,"percent":40.0},{"id":4,"title":"recommended","count":1,"percent":6.67}],"reactions":{},"added":535,"added_by_status":{"yet":13,"owned":513,"beaten":1,"toplay":1,"dropped":7},"playtime":1,"screenshots_count":61,"movies_count":0,"creators_count":0,"achievements_count":0,"parent_achievements_count":0,"reddit_url":"","reddit_name":"","reddit_description":"","reddit_logo":"","reddit_count":0,"twitch_count":0,"youtube_count":67,"reviews_text_count":0,"ratings_count":15,"suggestions_count":356,"alternative_names":[],"metacritic_url":"","parents_count":0,"additions_count":0,"game_series_count":0,"user_game":null,"reviews_count":15,"saturated_color":"0f0f0f","dominant_color":"0f0f0f","parent_platforms":[{"platform":{"id":1,"name":"PC","slug":"pc"}},{"platform":{"id":5,"name":"Apple Macintosh","slug":"mac"}},{"platform":{"id":6,"name":"Linux","slug":"linux"}}],"platforms":[{"platform":{"id":5,"name":"macOS","slug":"macos","image":null,"year_end":null,"year_start":null,"games_count":106313,"image_background":"https://media.rawg.io/media/games/618/618c2031a07bbff6b4f611f10b6bcdbc.jpg"},"released_at":"2013-11-19","requirements":{"minimum":"Minimum:\nOS: Snow Leopard 10.6 or better\nProcessor: 2.0 GHz PowerPC 970MP or better\nMemory: 2 GB RAM\nGraphics: Nvidia / ATI (shader model 2.0+, year 2004) or better\nStorage: 700 MB available space\nSound Card: N/A\nAdditional Notes: More is better...","recommended":"Recommended:\nOS: Mountain Lion 10.8 or better\nProcessor: Intel i5 or better\nMemory: 4 GB RAM\nGraphics: Nvidia / ATI (shader model 4.0+, year 2009) or better\nStorage: 700 MB available space\nSound Card: N/A\nAdditional Notes: More is better..."}},{"platform":{"id":4,"name":"PC","slug":"pc","image":null,"year_end":null,"year_start":null,"games_count":548064,"image_background":"https://media.rawg.io/media/games/587/587588c64afbff80e6f444eb2e46f9da.jpg"},"released_at":"2013-11-19","requirements":{"minimum":"Minimum:\nOS: Windows XP SP2 or better\nProcessor: Intel Core 2 Due / AMD Athlon x2 or better\nMemory: 2 GB RAM\nGraphics: Nvidia Gefore 6600 / ATI Radeon X800 (shader model 2.0+) or better\nDirectX: Version 9.0c\nStorage: 700 MB available space\nSound Card: N/A\nAdditional Notes: On 64 bit machines the following must be installed Microsoft Visual C++ Redist (64)","recommended":"Recommended:\nOS: Windows 7 or better\nProcessor: Intel Core 2 Quad / AMD Phenom 2 x4 or better\nMemory: 4 GB RAM\nGraphics: Nvidia Geforce 470GTX Titan / ATI Radeon 5850 or better\nDirectX: Version 11\nStorage: 700 MB available space\nSound Card: N/A\nAdditional Notes: On 64 bit machines the following must be installed Microsoft Visual C++ Redist (64)"}},{"platform":{"id":6,"name":"Linux","slug":"linux","image":null,"year_end":null,"year_start":null,"games_count":78913,"image_background":"https://media.rawg.io/media/games/d1a/d1a2e99ade53494c6330a0ed945fe823.jpg"},"released_at":"2013-11-19","requirements":{"minimum":"Minimum:\nOS: Ubuntu 12.04 or better\nProcessor: Intel Core 2 Duo / AMD Athlon x2 or better\nMemory: 2 GB RAM\nGraphics: Nvidia Geforce 6600 / ATI Radeon X800 (shader model 2.0+) or better\nStorage: 700 MB available space\nSound Card: N/A\nAdditional Notes: More is better...","recommended":"Recommended:\nOS: Ubuntu 12.04 or better\nProcessor: Intel Core 2 Quad / AMD Phenom 2 x4\nMemory: 4 GB RAM\nGraphics: Nvidia Geforce 470GTX / ATI Radeon 5850 or better\nStorage: 700 MB available space\nSound Card: N/A\nAdditional Notes: More is better..."}}],"stores":[{"id":12473,"url":"","store":{"id":1,"name":"Steam","slug":"steam","domain":"store.steampowered.com","games_count":111048,"image_background":"https://media.rawg.io/media/games/d82/d82990b9c67ba0d2d09d4e6fa88885a7.jpg"}}],"developers":[{"id":7443,"name":"Axis Game Factory","slug":"axis-game-factory-inc","games_count":1,"image_background":"https://media.rawg.io/media/screenshots/1e0/1e08c1150be3c0cf2574f93f2606b0e5.jpg"}],"genres":[{"id":34,"name":"Educational","slug":"educational","games_count":15690,"image_background":"https://media.rawg.io/media/screenshots/49d/49dae660a0fc843b23d63af8ce34e33c.jpg"}],"tags":[{"id":37,"name":"Sandbox","slug":"sandbox","language":"eng","games_count":7798,"image_background":"https://media.rawg.io/media/games/095/0953bf01cd4e4dd204aba85489ac9868.jpg"},{"id":40838,"name":"Includes level editor","slug":"includes-level-editor","language":"eng","games_count":2063,"image_background":"https://media.rawg.io/media/games/9cc/9cc11e2e81403186c7fa9c00c143d6e4.jpg"},{"id":86,"name":"Education","slug":"education","language":"eng","games_count":3407,"image_background":"https://media.rawg.io/media/screenshots/007/00769c75b7c44b5974d20204a27e9293.jpg"},{"id":173,"name":"Utilities","slug":"utilities","language":"eng","games_count":445,"image_background":"https://media.rawg.io/media/screenshots/6c3/6c3c74f18315de8af9ada80f55d3a8c1.jpg"},{"id":94,"name":"Design & Illustration","slug":"design-illustration","language":"eng","games_count":680,"image_background":"https://media.rawg.io/media/screenshots/37b/37b1d13604b8ac800558634619cd2a4a.jpg"},{"id":95,"name":"Animation & Modeling","slug":"animation-modeling","language":"eng","games_count":310,"image_background":"https://media.rawg.io/media/screenshots/49d/49dae660a0fc843b23d63af8ce34e33c.jpg"},{"id":92,"name":"Game Development","slug":"game-development","language":"eng","games_count":349,"image_background":"https://media.rawg.io/media/screenshots/6cd/6cd13ed3dcb6b44b8bc995850f2861e6.jpg"},{"id":261,"name":"Software Training","slug":"software-training","language":"eng","games_count":71,"image_background":"https://media.rawg.io/media/screenshots/774/774b7f29c1ba764728cf8e9b93e9e788.jpg"}],"publishers":[{"id":31899,"name":"Axis Game Factory","slug":"axis-game-factory","games_count":1,"image_background":"https://media.rawg.io/media/screenshots/ad6/ad683211916758f37ddf0bb382001cdb.jpg"}],"esrb_rating":null,"clip":null,"description_raw":"Axis Game Factory’s AGFPRO v3.0 – for PC, MAC and LINUX\nWe just released version 3.0 of AGFPRO & Premium - there are a TON of new features, assets and functionality that have been added, giving users the ability to create amazing game levels and maps like NEVER BEFORE!!\nMajor features to AGFPRO 3.0 include complete compatibility with Unity 5 for AGFPRO, Premium, Zombie FPS, Fantasy Side-Scroller, Drone Kombat, BattleMat Multiplayer, and Voxel Sculpt!  We have also added new character controls and characters in both the ARPG and Platformer Players!  What you will really see is the POWER and SPEED that comes with this update, allowing users to create lush scenes, filled with assets, foliage and other features and functionality.\nAGFPRO v3.0 is a comprehensive toolset designed to provide game developers and enthusiasts with a powerful and rapid level creation, terrain/vegetation editing, lighting and atmosphere system.\nAGF is an independent product that empowers users to create game levels and environments for many types of game genres, and the AGFPRO v3.0 PREMIUM version is also designed to work in concert with the Free and Pro versions of the Unity 5 game engine to allow further customization and game publishing. AGF runs on the PC, MAC and LINUX systems.\nAGF allows developers to rapidly create game maps, sculpt terrain and design levels quickly and easily. With over 1000+ assets pre-stocked in the warehouse, along with 48 pre-set themes and 8 sample maps, developers and enthusiasts can begin creating levels in minutes. AGFPRO v3.0 includes all of the necessary tools to allow users the ability to import AGF scenes into Unity3d Free and Pro 5.\nCreating game levels and maps in AGFPRO is easy and fun - now ANYONE can create their own quality game maps without having to program, model or animate!\nPlease note that in order to use AGFPRO Premium (DLC), you must first purchase AGFPRO.KEY FEATURES:\nAGFPRO v3.0 now Features Nine (9) Key Areas or Apps for Development that Include:\nAGF Launch Pad\nAGF World Editor\nAGF Construct App\nAGF Browser\nAGF Packager\nAGF Scene Loader\nARPG Player (Internal & External)\nPlatform Player (Internal & External)\nFPS Player (External)New v3.0 AGF Launch Pad:\nThis App replaces the AGF editor from the AGF icon in Steam\nLaunches all AGF Apps including the Editor from one toolbar\nNo need to go through the Editor to launch the PlayersNew v3.0 AGF World Editor Features:\nRedesigned GUI in the Editor\nDropdown menu system\nCollapsing, drag-able windows with easy to see icons\n3x Speed increase for terrain sculpting\nNew Smoothing feature for the terrain sculpting has been added to give the user the ability to smooth and soften terrain on their maps\nNew X, Y, Z directional compass added to the Editor\nCamera automatically changes the atmosphere when users are underwater vs. above water\nAddition of \"Build Time Clock\" that is saved with each scene file every time users work, creating a standing time on how long each level takes to create\nUser-Friendly Project Creation Wizard\no\tExtensive library of pre-set themes for immediate level design\no\tThemes include lighting, atmosphere, terrain, vegetation, & water pre-defined\nIntuitive User Interface with \"Radial Menu\" to expedite workflow\nDrag and reorganize windows to customize UI\nOn & Off feature quickly hide menus\nAdvanced Terrain Creation System\nAdjustable: terrain size, splat map & vegetation detail resolution\nSupports terrains from 200 meters up to 200 meters down max\nTerrains are now expanded to a maximum terrain of 4,000 meters square\n3x Speed increase for terrain sculpting\n10 levels of undo for terrain editing\nUndo Vegetation, Painting and Sculpting independent of each other\nPaint, Sculpt and Plant vegetation individually or simultaneously\nToggle: terrain visibility, painting, sculpting, planting\nSophisticated Brush Support\nExtensive brush library with adjustable brush size, rotation, power, blend\nEdit the entire Default Brush library for users preference\nProject specific and default brushes independent of each other\nVia the new integrated AGF Browser, users can now import their own original:  Brushes, Terrain Textures, Terrain Vegetation Textures in PNG. Format\nNewly added:  Custom Images can be both loaded and removed for the Brushes – Terrain and Vegetation\nReal Time Terrain Deformation and Painting System with Tri-Planar Texturing with Normal Maps\nToggle between tri-planar shader & simple\nIntuitive Terrain \"Snap to Grid Height\" to set terrain\nNumeric input and readout of terrain height at specific locations\nTri-Planar Shaders and Texturing\nShader automatically maps terrain inclines with user defined texture\nOver 40 textures included with Normal Maps\nTerrain Texture Color Tinting Feature\nChange individual textures or batch\nChange terrain textures quickly and update in real-time\nAdvanced Vegetation System\nAdjustable vegetation density & distance, unlimited layers\nSet vegetation min. width, height & color spectrum\nAdvanced Global Vegetation Editor\nGlobally change vegetation color saturation, value, size, minimum width & height, color spectrums\nFully featured lighting and atmosphere configuration allows quick real time and run-time customization\nCustomized Lighting System\nKey, Fill, Back, and Ambient light sources\nSet light colors, flares & shadow configurations\nExtensive Lens Flares to “main” light in lighting rig (over 15)\nNewly added Underwater Lighting system\nFog System\nGlobal and simple fog with a variety of parameters: density, falloff, color and distance\nSet fog haze, density, distance, color, height and falloff\nNewly added Fog System\nSkyboxes – Select skybox cube maps with the ability to apply rotation & tint\nBeautiful water system with sliders for wave direction, speed, intensity, refraction/reflection color and foam properties\nGeometry Brush System\nCreate unlimited sets of geometry brushes\nBrushes function as an independent layer to edit\nSet min/max scale range\nRandomly rotate X, Y, Z coordinates\nAlign to Normal\nSpray geometry from camera view direction\nUser-friendly file saving thumbnail generation for scenes when saved\nExtensive Presets to quickly start scenes (48 included)\nCreate custom presets and share with friends\nIndependent Pre-Fab Mode to create complex collections of assets outside of your scene\nFully featured transformation tools include:\nSelect, Multiple-Select, Copy/Paste, Duplicate, Translate, Rotate & Scale\nIntuitive Grid-Snapping and Collision Detection easily place objects in scene with new enhanced features that include:\nOn screen display of Grid Size\nOn screen display of Grid-Snap Setting\nThere are now reference numbers for both the X or Z Axis, the numbers change dynamically with the scale of the grid\nGrid Reference Number Scaling and Display Settings can be defined by the user\nNew Construct App Feature:\nGone is the old prefab workspace and it has been moved into its very own App\nConstruct is where you go to create your own prefab assets from the always-expanding library of textures and assets (over 1,000+) that are available in the AGFPRO Warehouse\nUsers can launch Construct from the Launchpad or from the Editor\nUse the “refresh assets” button to load prefabs into the Warehouse library\nConstruct allows users to import their own .OBJ files (objects or assets) as well as .PNG texture files\nLoad your own models, .OBJ files, directly into Construct – USERS NO LONGER HAVE TO IMPORT THEIR OWN ASSETS THROUGH UNITY PRO!!!!!   This feature is included in AGFPRO and Premium.\nCombine several .OBJ files and save them as a Prefab to be used in the World Editor\nNew AGF Browser (file browser)\nThis is a standalone browser that connects the AGF Apps together!\nThe new AGF Browser is designed to be the glue that is used to bring in users custom content.  Now users are able to bring in their own Textures and Objects files into AGF creations without the necessity of using Unity Free or Unity Pro… This feature is HUGE as it empowers users the flexibility to create their own custom levels with any supported asset types they choose to bring in with the ability to take their scene files back into Unity to publish their own work\nNew AGF Packager\nBy popular demand – we have added this great feature… AGF DLC users are able to package their games easily and share with anyone!  Just do the following:\n1) Select the Game Type\n2) Select the Project Folder\n3) Select the Destination of the New Game onto User’s Machine\n4) Give a Name to the Game\n… And the AGF Packager does the rest… it’s really that easy!  Best of all, friends do not need to own AGF to run the packaged game, nor do they need to have a Steam account. The Packaged Game is completely stand-alone, DRM FREE, and redistribution of users game(s) is encouraged. AGF Packager will make a game for the OS that it was packaged on. The AGF packaged games are NOT intended for resale. It’s about creating and sharing with all.\nAs an option, the Packager will automatically zip the game(s) package for easy distribution and no installation is required for the end user to play – no installers are necessary for friends to play – just unzip and have fun!\nNew AGF Scene Loader Features:\nThe AGF Scene Loader loads the AGF Scene Format into Unity Free and Unity Pro\nCustom Images that are used on terrains now load into Unity with scene(s) created in AGF\nAny locked assets in an AGF scene are no longer an issue… The AGF/Unity Scene Loader skips any assets that are not supposed to load automatically\nAny OBJ files that are loaded into AGF will also be loaded into Unity Free and Pro\nAction Role-Playing Game Player:\nThe ARGP Player provides users with player and camera controls that are genre specific for ARPG game creation\nUsing the Internal Player, creations can be played in real-time to play test map creations\nThe External Player allows users the ability to package and send their levels to others to play\nPlatform Player:\nThe Platform Player provides users with player and camera controls that are genre specific for Platform game level creation\nThe Internal Player allows users to immediately play and test their game maps in real-time\nThe External Player allows users the ability to package and send their levels to others to play\nFirst-Person Shooter Player:\nThis Player provides the user with an FPS camera and controller, specific for FPS game level creation and play testing\nThe FPS Player can be used with the AGF Packager to package their game levels to share with others\nThis Player also supports Scene-Linking and allows users to share their AGF FPS game level creations with friends and link their maps together for endless gameplay!\nFPS Weapon asset packs are also includedAGFPRO v3.0 PREMIUM\nAGFPRO + PREMIUM ASSET Packager – users are able to package their assets in Unity Pro and use in the AGF tool-set\nBatch Asset Processing\nAutomatic Icon Creation\nOver 500 Source Art Assets and Samples are included for Premium usersMore Information on what AGFPRO is and what you can do with AGFPRO\nUsers are able to create game levels and maps using the software and also place characters (provided with the software) to play and explore their levels with multiple player style options (Action Role Playing, Platformer, FPS)\nJust to be CLEAR – AGFPRO is NOT a game engine.  It is literally made using the Unity game engine.  AGFPRO is a real-time, RAPID Game Environment Development Toolkit and is made to be used in concert with Unity Free and Pro for level/map creation. – However, AGFPRO does NOT need Unity to run or create levels/maps.\nThe scene files that users create in AGFPRO “Basic” and “Premium” can be imported into Unity4 Free and Pro using our AGF/Unity tools.\nBy using the DLC we have already released for AGFPRO (Fantasy Side-Scroller,  Zombie FPS, Drone Kombat, BattleMat Multiplayer & Voxel Sculp), users are able to create playable levels with AGFPRO (only – not viable with Unity) with a variety of characters, assets, gameplay mechanics and special feature, “Scene-Linking” to connect game levels\nThere are limitations to some asset packs “locked (L)” that limit the users from loading these assets into Unity.  All unlocked asset packs are free of copyright and can be used via Unity for redistribution per the terms of the EULA http://ttp://media.wix.com/ugd/43457c_ee338ac5b4f644eb8b432518a8bb3d79.pdf\nThe redistribution or “sharing” of the games users are able to make using AGF and DLC “Players” is a feature we are working on at this time and will be made available to users at no additional fee\nUsers are also able to create and place specific game play mechanics that are provided in the software\nFull customization of your levels and maps is possible with AGFPRO Premium and Unity Pro, whereby users are able to bring in their own assets and models to make their games unique and further commercialize, making a complete Stand-Alone gameAdditional Questions RE: AGFPRO?If you are interested in making a complete Stand-Alone game with unique characters, models, assets and game play mechanics not provided in AGFPRO and  commercialize it for sale, you will need AGFPRO Premium and either Unity Free or Pro software\nIf you are a development team using AGFPRO + Premium, you will need one seat per team member using the software, but we do offer studio discounts, so be sure to contact us for special pricing\nWe have many schools all over the globe using AGFPRO to teach game development and design in the classroom, from middle schools to elite Colleges and Universities.  We have a basic curriculum available that instructors are able to include in their course curriculum and we provide additional support that includes software updates, access to DLC, non-Steam versions of the software if necessary, user support and special feature integration upon request and based on the terms of the agreement.  We offer special pricing for schools and we find that schools love using the software as it allows students the ability to create complete games within the limitation of a semester and is a great introduction to begin to interface with Unity3d, without users having to program, model, animate or script.  Please contact Tammy McDonald at tammy@heavyh2o.com if you have specific questions or interest regarding AGFPRO's Educational License."}